cask_args appdir: '/Applications'

# Apple store command line
brew 'mas'

tap 'github/gh'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'wagoodman/dive'

# Developer tools - brew
mas 'Xcode', id: 497799835
brew 'gitkraken'
brew 'ispell'
brew 'httpie'
brew 'wagoodman/dive/dive'
brew 'tokei'
brew 'gitmoji'
brew 'diff-so-fancy'
brew 'act'
brew 'bun' 
brew 'direnv'
brew 'make'
brew 'autoconf' 
brew 'automake'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'helm'
brew 'azure-cli'
brew 'vpn-slice'
brew 'k9s'
brew 'kops'
brew 'terraform'
brew 'hadolint'
brew 'lakefs'
brew 'pandoc'

cask 'qmk-toolbox'
cask 'visual-studio-code'
cask 'iterm2'
cask 'dash'
brew 'docker'
brew 'docker-compose'
brew 'kubectx'
brew 'colima'

# Command line tools - install new ones, update others to latest version
brew 'git'  # upgrade to latest
brew 'git-lfs' # track large files in git https://github.com/git-lfs/git-lfs
brew 'wget'
brew 'zsh' # zshell
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'tmux'
brew 'tree'
brew 'neofetch' 
brew 'curl --force'
brew 'grep --with-default-names'
brew 'trash'  # move to osx trash instead of rm
brew 'less'
brew 'cat'
brew 'exa'
brew 'bat'
brew 'fd'
brew 'ctop'
brew 'jq'
brew 'gh'
brew 'fzf'

# Notes
cask 'notion'
cask 'notion-calendar'

# Content related
cask 'ImageOptim'
cask 'screenflow'
cask 'obs'
cask 'postman'
cask 'keycastr'
cask 'skitch'
brew 'asciicinema'
cask 'adobe-creative-cloud'
cask 'loopback'
cask 'logitech-presentation'
cask 'soundsource'
cask 'razer-synapse'
cask 'fontbase'
cask 'figma'


# Productivity
cask 'wavebox'
cask 'brave-browser'
cask 'google-chrome'
cask 'cleanmymac'
cask 'clickup'
cask 'betterzip'
cask 'caffeine '
cask 'muzzle'
cask 'flux'
cask 'dropbox'
cask 'alfred'
cask 'bitwarden'
brew 'bitwarden-cli'
brew "openconnect"
brew 'switchaudio-osx'
cask 'raycast'
cask 'element'
cask 'polypane'

# Chat / video conference
cask 'slack'
cask 'zoom'
cask 'discord'

# Music
brew 'spotify' 
cask 'spotmenu'

# Coding fonts - for IDEs and terminal usage
cask 'font-fira-code'
cask 'font-fontawesome'
cask 'font-ibm-plex'
cask 'font-iosevka'
cask 'font-iosevka-slab'
cask 'font-pt-mono'
cask 'font-fantasque-sans-mono'
brew 'font-monaspace'

# Python
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'pyenv'
brew 'pipx'
brew 'pygments'

# node
brew 'node'
brew 'yarn'
brew 'oven-sh/bun/bun'
brew 'node-sass'

# Ruby
brew 'rbvenv'
brew 'ruby-build'

# sass
brew 'sass/sass/sass'

mas 'Boxy SVG', id: 611658502
mas 'GIPHY CAPTURE', id: 668208984
mas 'HP Smart', id: 1474276998
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Sim Daltonism', id: 693112260
mas 'Trello', id: 1278508951
mas 'TweetDeck', id: 485812721
mas 'WhatsApp', id: 1147396723
