# Options
cask_args appdir: '/Applications', require_sha: true

# Fonts
tap 'homebrew/dle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'hashicorp/tap'


#############################################################
# Command Line                                              #
#############################################################
#  Basic command line tools
brew 'bat'          # cat replacement
brew 'ctop'         # Container metrics and monitoring
brew 'curl --force' # transfer data with urls
brew 'broot'        # interactive dir navigation
brew 'eza'          # ls replacement
brew 'fd'           # find replacement
brew 'fzf'          # fuzzy finder
brew 'git'          # version control
brew 'git-lfs'      # track large files in git https://github.com/git-lfs/git-lfs
brew 'grep --with-default-names' # search text
brew 'jdupes'       # find duplicate files
brew 'jq'           # JSON parser, output and query files
brew 'less'         # pagination
brew 'mcfly'        # better history
brew 'most'         # better less
brew 'procs'        # Advanced process viewer (better ps)
brew 'ranger'       # Directory browser
brew 'ripgrep'      # Searching within files (better grep)
brew 'rsync'        # fast incremental file transfer
brew 'sd'           # better sed
brew 'thefuck'      # auto correct mistyped commands
brew 'trash'        # move to osx trash instead of rm
brew 'tree'         # list directory trees
brew 'tmux'         # terminal multiplexer
brew 'wget'         # download files from the web
brew 'xsel'         # Copy paste access to the X clipboard
brew 'zoxide'       # better cd
brew 'zsh'          # zshell
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'autoconf'
brew 'automake'     # autogeneration of makefiles
brew 'diff-so-fancy'# better diffs
brew 'dive'         # container checks
brew 'direnv'       # env files management
brew 'gitmoji'
brew 'hadolint'     # dockerfile linting
brew 'httpie'       # HTTP / API testing testing client
brew 'ispell'       # spell check
brew 'k9s'
brew 'kops'
brew 'make'
brew 'navi'         # cheatsheet
brew 'tokei'        # better counter


#############################################################
# Software Development                                      #
#############################################################

cask 'qmk-toolbox'      # keyboard prog
cask 'dash'             # documentation
brew 'docker'           # containerization
brew 'docker-compose'   # container orchestration
brew 'colima'           # containerization
brew 'hashicorp/tap/terraform' # infrastructure as code
brew 'helm'             # kubernetes package manager
brew 'kubectx'          # kubernetes context switcher
brew 'kubernetes-cli'   # kubernetes command line
brew 'minikube'         # kubernetes local cluster
cask 'postman'          # API testing

# Notes
cask 'notion'
cask 'notion-calendar'

# Development utils
brew 'act'              # github actions locally
brew 'gh'               # github cli
brew 'git-extras'       # git utilities
brew 'gitkraken'        # git gui
cask 'iterm2'           # terminal
brew 'pandoc'           # document converter
brew 'secretive'        # safer ssh keys management
cask 'visual-studio-code'
brew 'git-codereview'   # code review

# Security Utilities and Data Encryption
cask 'gpg-suite'      # PGP encryption for emails and files
brew 'git-crypt'      # Transparent encryption for git repos
brew 'openssl'        # Cryptography and SSL/TLS Toolkit
brew 'rkhunter'       # Search / detect potential root kits

#############################################################
# Desktop Applications                                      #
#############################################################

# Creative and content creation
brew 'asciicinema'
cask 'ImageOptim'
cask 'adobe-creative-cloud'
cask 'figma'
cask 'fontbase'
cask 'keycastr'
cask 'logitech-presentation'
cask 'logitech-options'
cask 'loopback'
cask 'obs'
cask 'screenflow'
cask 'skitch'
cask 'soundsource'

# Browsers
cask 'brave-browser'
cask 'google-chrome'
cask 'wavebox'

# Personal applications
cask 'alfred'
cask 'betterzip'
cask 'bitwarden'
brew 'bitwarden-cli'
cask 'cleanmymac'
cask 'clickup'
cask 'dropbox'
cask 'flux'
cask 'element'
cask 'muzzle'
cask 'polypane'

# Chat / video conference
cask 'slack'
cask 'discord'

# Media
cask 'razer-synapse'
brew 'spotify' , args: { require_sha: false }
cask 'spotmenu'
cask 'vlc'

# Fonts
cask 'font-fira-code'
cask 'font-fontawesome'
cask 'font-ibm-plex'
cask 'font-iosevka'
cask 'font-iosevka-slab'
cask 'font-pt-mono'
cask 'font-fantasque-sans-mono'
brew 'font-monaspace'

# Python
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'pyenv'
brew 'pipx'
brew 'pygments'
brew 'pixi'

# node
brew 'node'
brew 'yarn'
brew 'oven-sh/bun/bun'
brew 'node-sass'

# sass
brew 'sass/sass/sass'

#############################################################
# MacOS-Specific Stuff                                      #
#############################################################
# Apple store command line and apps
brew 'mas'
mas 'Xcode', id: 497799835

brew 'm-cli'        # macOS specific CLI
cask 'openinterminal' # open terminal from finder
brew 'switchaudio-osx' # switch audio input/output
cask 'raycast', args: { require_sha: false }  # Spotlight alternative

mas 'Boxy SVG', id: 611658502
mas 'GIPHY CAPTURE', id: 668208984
mas 'HP Smart', id: 1474276998
mas 'Magnet', id: 441258766
mas 'Sim Daltonism', id: 693112260
mas 'WhatsApp', id: 1147396723
mas 'Slack', id: 803453959
mas 'Bitwarden', id: 1352778147
mas 'Harvest', id: 506189836

# EOF
