# Options
cask_args appdir: '/Applications', require_sha: true

# Fonts
tap 'homebrew/dle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'hashicorp/tap'


#############################################################
# Command Line                                              #
#############################################################
# Install new ones, update others to latest version
brew 'git'          # version control
brew 'git-lfs'      # track large files in git https://github.com/git-lfs/git-lfs
brew 'wget'         # download files from the web
brew 'zsh'          # zshell
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'tmux'        # terminal multiplexer
brew 'tree'        # list directory trees
brew 'curl --force' # transfer data with urls
brew 'grep --with-default-names' # search text
brew 'trash'        # move to osx trash instead of rm
brew 'less'         # pagination
brew 'eza'          # ls replacement
brew 'bat'          # cat replacement
brew 'fd'           # find replacement
brew 'broot'        # interactive dir navigation
brew 'fzf'          # fuzzy finder
brew 'jdupes'       # find duplicate files
brew 'most'         # better less
brew 'thefuck'      # auto correct mistyped commands
brew 'rsync'        # fast incremental file transfer
brew 'sd'           # better sed
brew 'zoxide'        # better cd
brew 'ctop'         # Container metrics and monitoring
brew 'jq'
brew 'ranger'

# CLI productivity
brew 'ispell'       # spell check
brew 'httpie'       # HTTP / API testing testing client
brew 'dive'         # container checks
brew 'tokei'
brew 'gitmoji'
brew 'diff-so-fancy'
brew 'direnv'
brew 'make'
brew 'autoconf' 
brew 'automake'
brew 'k9s'
brew 'kops'
brew 'hadolint'
brew 'pandoc'
brew 'navi'         # cheatsheet


#############################################################
# Software Development                                      #
#############################################################

cask 'qmk-toolbox'  # keyboard prog
cask 'dash'         # documentation
brew 'docker'       # containerization
brew 'docker-compose' # container orchestration
brew 'kubectx'      # kubernetes context switcher
brew 'colima'       # containerization
brew 'kubernetes-cli'   # kubernetes command line
brew 'helm'         # kubernetes package manager
brew 'hashicorp/tap/terraform' # infrastructure as code
cask 'postman'      # API testing

# Notes
cask 'notion'
cask 'notion-calendar'

# Development utils
brew 'gh'
brew 'git-extras'  # git utilities
brew 'gitkraken'    # git gui
brew 'act'          # github actions locally
cask 'visual-studio-code'  
cask 'iterm2'

# Security Utilities and Data Encryption
cask 'gpg-suite'      # PGP encryption for emails and files
brew 'git-crypt'      # Transparent encryption for git repos
brew 'openssl'        # Cryptography and SSL/TLS Toolkit
brew 'rkhunter'       # Search / detect potential root kits

#############################################################
# Desktop Applications                                      #
#############################################################

# Content related
cask 'ImageOptim'
cask 'screenflow'
cask 'obs'
cask 'keycastr'
cask 'skitch'
brew 'asciicinema'
cask 'adobe-creative-cloud'
cask 'loopback'
cask 'logitech-presentation'
cask 'logitech-options'
cask 'soundsource'
cask 'razer-synapse'
cask 'fontbase'
cask 'figma'

# Browsers
cask 'brave-browser'
cask 'google-chrome'
cask 'wavebox'

# Personal applications
cask 'cleanmymac'
cask 'clickup'
cask 'betterzip'
cask 'muzzle'
cask 'flux'
cask 'dropbox'
cask 'alfred'
cask 'bitwarden'
brew 'bitwarden-cli'
brew "openconnect"
cask 'element'
cask 'polypane'

# Chat / video conference
cask 'slack'
cask 'discord'

# Media
brew 'spotify' , args: { require_sha: false }
cask 'spotmenu'
cask 'vlc'

# Fonts
cask 'font-fira-code'
cask 'font-fontawesome'
cask 'font-ibm-plex'
cask 'font-iosevka'
cask 'font-iosevka-slab'
cask 'font-pt-mono'
cask 'font-fantasque-sans-mono'
brew 'font-monaspace'

# Python
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'pyenv'
brew 'pipx'
brew 'pygments'

# node
brew 'node'
brew 'yarn'
brew 'oven-sh/bun/bun'
brew 'node-sass'

# sass
brew 'sass/sass/sass'


#############################################################
# MacOS-Specific Stuff                                      #
#############################################################
# Apple store command line and apps
brew 'mas'
mas 'Xcode', id: 497799835

brew 'm-cli'        # macOS specific CLI    
cask 'openinterminal' # open terminal from finder
brew 'switchaudio-osx' # switch audio input/output
cask 'raycast', args: { require_sha: false }  # Spotlight alternative

mas 'Boxy SVG', id: 611658502
mas 'GIPHY CAPTURE', id: 668208984
mas 'HP Smart', id: 1474276998
mas 'Magnet', id: 441258766
mas 'Sim Daltonism', id: 693112260
mas 'WhatsApp', id: 1147396723
mas 'Slack', id: 803453959
mas 'Bitwarden', id: 1352778147
mas 'Harvest', id: 506189836

# EOF
