adamgirton.gloom
ahmadawais.shades-of-purple
AlanWalk.markdown-toc
axiomaticstudios.one-monokai-80s
bierner.markdown-emoji
bierner.markdown-preview-github-styles
brittanychiang.halcyon-vscode
bungcip.better-toml
CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.jupyter
eamodio.gitlens
Equinusocio.vsc-material-theme
GrapeCity.gc-excelviewer
hbenl.vscode-test-explorer
Heron.firefox-devtools-theme
Ikuyadeu.r
interactiveRob.sedona
ipedrazas.kubernetes-snippets
jaredkent.laserwave
kenziebottoms.replicant
kyleerickson.night-rider
lextudio.restructuredtext
littlefoxteam.vscode-python-test-adapter
mauve.terraform
mdickin.markdown-shortcuts
michelemelluso.code-beautifier
mikestead.dotenv
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.anaconda-extension-pack
ms-python.python
ms-vscode.azurecli
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
Nkzq.sass-variables-helper
nopjmp.fairyfloss
oderwat.indent-rainbow
pancho111203.vscode-ipython
PeterJausovec.vscode-docker
PKief.material-icon-theme
quangogage.pastel-pixels
redhat.vscode-yaml
ritwickdey.live-sass
ritwickdey.LiveServer
robinbentley.sass-indented
sallar.vscode-duotone-dark
samrapdev.outrun
sdras.night-owl
shd101wyy.markdown-preview-enhanced
shyykoserhiy.vscode-spotify
soft-aesthetic.soft-era-theme
sozercan.slack
taniarascia.new-moon-dracula-vscode
taniarascia.new-moon-vscode
TBVanderleyStudios.skeletor
technosophos.vscode-make
TheaFlowers.witch-hazel
wart.ariake-dark
whizkydee.material-palenight-theme
wholroyd.jinja
yzhang.markdown-all-in-one
zhuangtongfa.Material-theme
